Test/Jerome_Test/ManageResourceInventory/IIS/xml/7-1_sbn_getInventoryWithBatchNotificationRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsnt="http://docs.oasis-open.org/wsn/bw-2" xmlns:bn="http://www.tmforum.org/mtop/fmw/xsd/mepbn/v1"  xmlns:mep="http://www.tmforum.org/mtop/fmw/xsd/mep/v1" xmlns:invr="http://www.tmforum.org/mtop/mri/xsd/rir/v1" xmlns:gen="http://www.tmforum.org/mtop/fmw/xsd/gen/v1" xmlns:nam="http://www.tmforum.org/mtop/fmw/xsd/nam/v1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.tmforum.org/mtop/mri/xsd/rir/v1 ../xsd/ResourceInventoryRetrievalMessagesV1-0.xsd  
http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <wsa:To>http://host:port/ServiceProvider</wsa:To>
    <wsa:Action>http://www.tmforum.org/mtop/mri/wsdl/rir/v1-0/getInventoryWithBatchNotificationRequest</wsa:Action>
    <wsa:RelatesTo>http://host:port/operation2222</wsa:RelatesTo>
  </soap:Header>
  <soap:Body>
    <invr:getInventoryWithBatchNotificationRequest>
      <bn:howMany>500</bn:howMany>
      <bn:batchNotificationEpr>
        <wsa:Address>http://host:port/ServiceConsumer</wsa:Address>
        <wsa:PortType>wsnt:NotificationConsumer</wsa:PortType>
      </bn:batchNotificationEpr>
      <invr:filter>
        <invr:baseInstance>
          <nam:object>
            <nam:type>mdNm</nam:type>
            <nam:name>string</nam:name>
          </nam:object>
        </invr:baseInstance>
        <invr:includedObjectType>
          <invr:objectType>ME</invr:objectType>
          <invr:granularity>ATTRS</invr:granularity>
        </invr:includedObjectType>
        <invr:includedObjectType>
          <invr:objectType>PTP</invr:objectType>
          <invr:granularity>ATTRS</invr:granularity>
        </invr:includedObjectType>
        <invr:includedObjectType>
          <invr:objectType>CTP</invr:objectType>
          <invr:granularity>ATTRS</invr:granularity>
        </invr:includedObjectType>
      </invr:filter>
    </invr:getInventoryWithBatchNotificationRequest>
  </soap:Body>
</soap:Envelope>
